<a href="https://colab.research.google.com/github/kim-jiha95/data_diving/blob/main/1%EA%B0%95_%EA%B3%BC%EC%A0%9C_ipynb%EC%9D%98_%EC%82%AC%EB%B3%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# üî• Quiz  1: Titanic Dataset

ÌÉÄÏù¥ÎÇòÌã± Îç∞Ïù¥ÌÑ∞ÏÖãÏùÄ Ïã§Ï†ú ÌÉÄÏù¥ÌÉÄÎãâ Ìò∏Ïóê ÌÉëÏäπÌñàÎçò ÏäπÍ∞ùÎì§Ïùò Ï†ïÎ≥¥(ÏÑ±Î≥Ñ, ÎÇòÏù¥ Îì±)Î•º Îã¥Í≥† ÏûàÏäµÎãàÎã§.  
Ïù¥Î•º Î∞îÌÉïÏúºÎ°ú ÏäπÍ∞ùÏùò ÏÉùÏ°¥Ïó¨Î∂Ä ÎòêÎäî ÏÉùÏ°¥Ïú®ÏùÑ ÏòàÏ∏°ÌïòÎäîÎç∞ ÌôúÏö©Îê©ÎãàÎã§.

Ïù¥Î≤à ÌÄ¥Ï¶àÏóêÏÑúÎäî Ïã§Ï†ú Îç∞Ïù¥ÌÑ∞ÏÖãÏúºÎ°ú **Ïä§Ïä§Î°ú** ÌÉêÏÉâÏ†Å ÏûêÎ£åÎ∂ÑÏÑùÏùÑ Ïã§ÏãúÌï¥Î¥ÖÏãúÎã§.

Îã§Ïùå Î¨ºÏùåÏóê ÎãµÌï¥Ï£ºÏÑ∏Ïöî!

ÏãúÏûëÌïòÍ∏∞ Ï†ÑÏóê ÌïÑÏöîÌïú ÎùºÏù¥Î∏åÎü¨Î¶¨Îì§ÏùÑ Î∂àÎü¨ÏòµÏãúÎã§

In [ ]:
import pandas as pd
from google.colab import drive
import os

## Problem 1

ÏàòÏóÖÏãúÍ∞ÑÏóê  Ìïú Í≤ÉÏ≤òÎüº `titanic_train.csv` ÌååÏùºÏùÑ Î∂àÎü¨ÏôÄ  `titanic` Î≥ÄÏàòÏóê  Ï†ÄÏû•Ìï¥Î≥¥ÏÑ∏Ïöî!

In [ ]:
# prob1
# ...
from google.colab import drive    # Google Drive Ìå®ÌÇ§ÏßÄ Î∂àÎü¨Ïò§Í∏∞
drive.mount('/content/gdrive/')

import time
import os
import pandas as pd
import re

os.chdir('/content/gdrive/My Drive/Colab Notebooks/datascience')

titanic_df = pd.read_csv('/content/gdrive/My Drive/Colab Notebooks/datascience/titanic_train.csv')     # ÌòÑÏû¨ ÏûëÏóÖ ÌôòÍ≤Ω Í≤ΩÎ°ú Í∏∞Ï§Ä
titanic_df

Mounted at /content/gdrive/

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
titanic_df.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Ïûò Î∂àÎü¨ÏôÄÏ°åÎã§Î©¥ `titanic.head(5)`Î•º ÏûÖÎ†•ÌñàÏùÑ Îïå Îã§ÏùåÍ≥º Í∞ôÏùÄ Í≤∞Í≥ºÍ∞Ä ÎÇòÏôÄÏïºÌï©ÎãàÎã§.

<img src = "https://1.bp.blogspot.com/-7r6_GPSB56c/Xti-B3jBxsI/AAAAAAAAAZg/sODqzWZA4y4Bsc0wIybtP6TFb-C3YJQTwCLcBGAsYHQ/s1600/%25E1%2584%2589%25E1%2585%25B3%25E1%2584%258F%25E1%2585%25B3%25E1%2584%2585%25E1%2585%25B5%25E1%2586%25AB%25E1%2584%2589%25E1%2585%25A3%25E1%2586%25BA%2B2020-06-04%2B%25E1%2584%258B%25E1%2585%25A9%25E1%2584%2592%25E1%2585%25AE%2B6.24.35.png">

üëÄ ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞ÏÖãÏùò Ïó¥Îì§ÏùÄ Îã§ÏùåÏùÑ ÏùòÎØ∏Ìï©ÎãàÎã§.

- Survived = ÏÉùÏ°¥ Ïó¨Î∂Ä
- Pclass = Ìã∞ÏºìÏùò Îì±Í∏â
- Sex = ÏÑ±Î≥Ñ
- Age = ÎÇòÏù¥
- Sibsp = ÎèôÏäπÌïú ÌòïÏ†ú ÏûêÎß§ / Î∞∞Ïö∞Ïûê Ïàò
- Parch = ÎèôÏäπÌïú Î∂ÄÎ™® / ÏûêÏãù Ïàò
- Fare = ÏöîÍ∏à
- Embarked = ÏäπÏÑ†Ìï≠

In [ ]:
titanic_df.shape

(891, 12)

In [ ]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
titanic_df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
titanic_df.

## Problem 2

`titanic_count` Î≥ÄÏàòÏôÄ `titanic_dim`  Î≥ÄÏàòÏóê Í∞ÅÍ∞Å titanic datasetÏùò ÏûêÎ£åÏùò Ïàò(ÌñâÏùò Ïàò)ÏôÄ Ï∞®Ïõê(Ïó¥Ïùò Ïàò)Î•º
 Ï†ÄÏû•Ìï¥Ï£ºÏÑ∏Ïöî

In [ ]:
# prob 2
titanic_count = 891
titanic_dim =  12
print(titanic_count)
print(titanic_dim)

891
12

## Problem 3

`titanic_fare_std` Î≥ÄÏàòÏóê ÌÉÄÏù¥ÌÉÄÎãâ Ìò∏ ÌÉëÏäπÍ∂åÏùò Í∞ÄÍ≤©(Fare)Ïùò ÌëúÏ§ÄÌé∏Ï∞®Î•º Ï†ÄÏû•Ìï¥Ï£ºÏÑ∏Ïöî (ÌûåÌä∏: ÌåêÎã§Ïä§Ïùò Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê `.std()` Ìï®ÏàòÎ•º Ìò∏Ï∂úÌïòÎ©¥ ÌëúÏ§ÄÌé∏Ï∞®Î•º Í≥ÑÏÇ∞Ìï† Ïàò ÏûàÏäµÎãàÎã§.)

In [ ]:
titanic_fare_std = titanic_df['Fare'].std()
print(titanic_fare_std)

49.693428597180905

## Problem 4

`titanic_fsurv` Î≥ÄÏàòÏôÄ `titanic_age_msurv` Î≥ÄÏàòÏóê Í∞ÅÍ∞Å Ïó¨ÏÑ±(female)Í≥º ÎÇ®ÏÑ±(male)Ïùò ÌèâÍ∑† Ïó∞Î†π(Age)ÏùÑ Í≥ÑÏÇ∞Ìï¥ Ï†ÄÏû•Ìï¥Î≥¥ÏÑ∏Ïöî. 

(ÌûåÌä∏: ÌåêÎã§Ïä§Ïùò Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê `.mean()` Ìï®ÏàòÎ•º Ìò∏Ï∂úÌïòÎ©¥ ÌèâÍ∑†ÏùÑ Í≥ÑÏÇ∞Ìï† Ïàò ÏûàÏäµÎãàÎã§)

> Ïñ¥Îñ§ ÏÑ±Î≥ÑÏùò ÌèâÍ∑† Ïó∞Î†πÏù¥ Îçî ÏûëÏùÄÍ∞ÄÏöî?

In [ ]:
# sol 4
titanic_fsurv =  titanic_df[titanic_df['Sex'] == 'female']['Age'].mean()
titanic_age_msurv = titanic_df[titanic_df['Sex']=='male']['Age'].mean()
print(titanic_fsurv)
print(titanic_age_msurv)

27.915708812260537
30.72664459161148

# Quiz 1 ÎãµÏïàÏßÄ

## Solution 1

In [ ]:
# sol 1
drive.mount('/content/gdrive/')
os.chdir('/content/gdrive/My Drive/Colab Notebooks/datascience')

In [ ]:
titanic = pd.read_csv('./titanic_train.csv')
titanic.head(5)

## Solution 2

In [ ]:
# sol 2
titanic_count = titanic.shape[0]
titanic_dim = titanic.shape[1]

## Solution 3

In [ ]:
# sol 3
titanic_fare_std = titanic['Fare'].std()

## Solution 4

In [ ]:
# sol 4
titanic_fsurv = titanic[titanic['Sex'] == 'female']['Age'].mean()
titanic_msurv = titanic[titanic['Sex'] == 'male']['Age'].mean()

# or 
titanic_fsurv, titanic_msurv = titanic.groupby(by='Sex')['Age'].mean()